Lecture2/elbow2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

h0 1.6;
L0 3.2;

h1 1.6;
L1 1.6;

R0 1.6;
R1 3.2;


vertices
(
( 0.0 0.0 0.0) //P0
( 3.2 0.0 0.0) //P1
( 3.2 1.6 0.0) //P2
( 0.0 1.6 0.0) //P3
( 0.0 0.0 0.1) //P4
( 3.2 0.0 0.1) //P5
( 3.2 1.6 0.1) //P6
( 0.0 1.6 0.1) //P7
( 5.253923937140636 0.7461466098316487 0.0) //P8
( 5.253923937140636 0.0 0.0) //P9
( 5.653853390168352 0.0 0.0) //P10
( 5.653853390168352 1.1460760628593643 0.0) //P11
( 5.253923937140636 0.7461466098316487 0.1) //P12
( 5.253923937140636 0.0 0.1) //P13
( 5.653853390168352 0.0 0.1) //P14
( 5.653853390168352 1.1460760628593643 0.1) //P15
( 4.226961968570318 1.9730733049158244 0.0) //P16
( 4.426926695084176 2.173038031429682 0.0) //P17
( 4.226961968570318 1.9730733049158244 0.1) //P18
( 4.426926695084176 2.173038031429682 0.1) //P19
( 6.4 3.2 0.0) //P20
( 6.4 6.4 0.0) //P21
( 4.800000000000001 6.4 0.0) //P22
( 4.800000000000001 3.2 0.0) //P23
( 6.4 3.2 0.1) //P24
( 6.4 6.4 0.1) //P25
( 4.800000000000001 6.4 0.1) //P26
( 4.800000000000001 3.2 0.1) //P27
);

blocks
(
   hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
   hex (1 8 16 2 5 12 18 6) (40 40 1) simpleGrading (1 1 1)
   hex (8 11 17 16 12 15 19 18) (10 40 1) simpleGrading (1 1 1) //Elbow on top of the small inlet x(8-> 11) y(11-> 17)
   hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading ( 1 1 1) //Small inlet x(8->9) , y(9->14)
   hex (17 11 20 23 19 15 24 27) (40 40 1) simpleGrading (1 1 1)
   hex (23 20 21 22 27 24 25 26) (40 40 1) simpleGrading (1 1 1)
);

edges
(
    arc 2 16 ( 4.114517056063259 1.8871182253647554 0.0)
    arc 6 18 ( 4.114517056063259 1.8871182253647554 0.1)
    arc 16 17 ( 4.331370849898477 2.068629150101524 0.0)
    arc 18 19 ( 4.331370849898477 2.068629150101524 0.1)
    arc 1 8 ( 5.029034112126519 0.5742364507295106 0.0)
    arc 5 12 ( 5.029034112126519 0.5742364507295106 0.1)
    arc 8 11 ( 5.462741699796952 0.9372583002030481 0.0)
    arc 12 15 ( 5.462741699796952 0.9372583002030481 0.1)
    arc 17 23 ( 4.512881774635245 2.2854829439367412 0.0)
    arc 19 27 ( 4.512881774635245 2.2854829439367412 0.1)
    arc 11 20 ( 5.825763549270491 1.3709658878734823 0.0)
    arc 15 24 ( 5.825763549270491 1.3709658878734823 0.1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    inletSmall
    {
        type patch;
        faces
        (
            (9 13 14 10)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (26 22 21 25)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (7 3 2 6)
            (0 4 5 1)
            (6 2 16 18)
            (1 5 12 8)
            (8 12 13 9)
            (15 11 10 14)
            (23 27 19 17)
            (24 20 11 15)
            (22 26 27 23)
            (25 21 20 24)
            (19 18 16 17)

        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (3 0 1 2)
            (4 7 5 6)
            (2 1 8 16)
            (5 6 18 12)
            (16 8 11 17)
            (18 19 15 12)
            (23 17 11 20)
            (27 24 15 19)
            (22 23 20 21)
            (26 25 24 27)
            (8 9 10 11)
            (12 15 14 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
